CSI API ETABS v1

# cDesignCompositeBeamGetDesignSection Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetDesignSection(
    	string Name,
    	ref string PropName
    )

    Function GetDesignSection (
    	Name As String,
    	ByRef PropName As String
    ) As Integer

    Dim instance As cDesignCompositeBeam
    Dim Name As String
    Dim PropName As String
    Dim returnValue As Integer

    returnValue = instance.GetDesignSection(Name,
    	PropName)

    int GetDesignSection(
    	String^ Name,
    	String^% PropName
    )

    abstract GetDesignSection :
            Name : string *
            PropName : string byref -> int

#### Parameters

Name

    Type: SystemString

PropName

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cDesignCompositeBeam Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com